# Occupation

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [3]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [4]:
ds = users.copy()

In [5]:
ds = ds.groupby("gender").count()
ds

        age  occupation  zip_code
gender
F       273         273       273
M       670         670       670

In [6]:
# create a function
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

# apply the function to the gender column and create a new column
users['gender_n'] = users['gender'].apply(gender_to_numeric)

users

         age gender     occupation zip_code  gender_n
user_id
1         24      M     technician    85711         1
2         53      F          other    94043         0
3         23      M         writer    32067         1
4         24      M     technician    43537         1
5         33      F          other    15213         0
...      ...    ...            ...      ...       ...
939       26      F        student    33319         0
940       32      M  administrator    02215         1
941       20      M        student    97229         1
942       48      F      librarian    78209         0
943       22      M        student    77841         1

[943 rows x 5 columns]

In [7]:
users.groupby('occupation').gender_n.sum()

occupation
administrator     43
artist            15
doctor             7
educator          69
engineer          65
entertainment     16
executive         29
healthcare         5
homemaker          1
lawyer            10
librarian         22
marketing         16
none               5
other             69
programmer        60
retired           13
salesman           9
scientist         28
student          136
technician        26
writer            26
Name: gender_n, dtype: int64

In [8]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [9]:
sa = "a"
sa = sa.join("222")
sa

'2a2a2'

In [10]:
a = (users.groupby('occupation').gender_n.sum() / users.occupation.value_counts()) * 100 

# sort to the most male 
a = a.sort_values(ascending = False).round(2)
a.astype(str) + "%"

doctor           100.0%
engineer         97.01%
technician        96.3%
retired          92.86%
programmer       90.91%
executive        90.62%
scientist        90.32%
entertainment    88.89%
lawyer           83.33%
salesman          75.0%
educator         72.63%
student          69.39%
other            65.71%
marketing        61.54%
writer           57.78%
none             55.56%
administrator    54.43%
artist           53.57%
librarian        43.14%
healthcare       31.25%
homemaker        14.29%
dtype: object

### Step 6. For each occupation, calculate the minimum and maximum ages

In [11]:
users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [12]:
users.groupby(['occupation', 'gender']).mean().loc[:,:"age"]

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### Step 8.  For each occupation present the percentage of women and men

In [13]:
users = users.reset_index()

In [14]:
users.groupby("occupation").count()

               user_id  age  gender  zip_code  gender_n
occupation
administrator       79   79      79        79        79
artist              28   28      28        28        28
doctor               7    7       7         7         7
educator            95   95      95        95        95
engineer            67   67      67        67        67
entertainment       18   18      18        18        18
executive           32   32      32        32        32
healthcare          16   16      16        16        16
homemaker            7    7       7         7         7
lawyer              12   12      12        12        12
librarian           51   51      51        51        51
marketing           26   26      26        26        26
none                 9    9       9         9         9
other              105  105     105       105       105
programmer          66   66      66        66        66
retired             14   14      14        14        14
salesman            12   12      12        12        12
scientist           31   31      31        31        31
student            196  196     196       196       196
technician          27   27      27        27        27
writer              45   45      45        45        45

In [15]:
step_7 = pd.pivot_table(data=users, values="age", index="occupation", columns="gender", aggfunc="count")
step_7=step_7.fillna(0)
step_7["total"]= step_7["F"]+step_7["M"]
step_7

gender            F      M  total
occupation
administrator  36.0   43.0   79.0
artist         13.0   15.0   28.0
doctor          0.0    7.0    7.0
educator       26.0   69.0   95.0
engineer        2.0   65.0   67.0
entertainment   2.0   16.0   18.0
executive       3.0   29.0   32.0
healthcare     11.0    5.0   16.0
homemaker       6.0    1.0    7.0
lawyer          2.0   10.0   12.0
librarian      29.0   22.0   51.0
marketing      10.0   16.0   26.0
none            4.0    5.0    9.0
other          36.0   69.0  105.0
programmer      6.0   60.0   66.0
retired         1.0   13.0   14.0
salesman        3.0    9.0   12.0
scientist       3.0   28.0   31.0
student        60.0  136.0  196.0
technician      1.0   26.0   27.0
writer         19.0   26.0   45.0

In [16]:
step_7["F"] = round(((step_7['F']/step_7['total'])*100),2).astype(str)+"%"
step_7["M"] = round(((step_7['M']/step_7['total'])*100),2).astype(str)+"%"

In [17]:
step_7.drop("total", axis = 1, inplace=True)

In [18]:
step_7

gender              F       M
occupation
administrator  45.57%  54.43%
artist         46.43%  53.57%
doctor           0.0%  100.0%
educator       27.37%  72.63%
engineer        2.99%  97.01%
entertainment  11.11%  88.89%
executive       9.38%  90.62%
healthcare     68.75%  31.25%
homemaker      85.71%  14.29%
lawyer         16.67%  83.33%
librarian      56.86%  43.14%
marketing      38.46%  61.54%
none           44.44%  55.56%
other          34.29%  65.71%
programmer      9.09%  90.91%
retired         7.14%  92.86%
salesman        25.0%   75.0%
scientist       9.68%  90.32%
student        30.61%  69.39%
technician       3.7%   96.3%
writer         42.22%  57.78%

In [19]:
a

doctor           100.00
engineer          97.01
technician        96.30
retired           92.86
programmer        90.91
executive         90.62
scientist         90.32
entertainment     88.89
lawyer            83.33
salesman          75.00
educator          72.63
student           69.39
other             65.71
marketing         61.54
writer            57.78
none              55.56
administrator     54.43
artist            53.57
librarian         43.14
healthcare        31.25
homemaker         14.29
dtype: float64

In [20]:
f = 100 - a
f = f.sort_values(ascending=False).round(2).astype(str) + "%"
f

homemaker        85.71%
healthcare       68.75%
librarian        56.86%
artist           46.43%
administrator    45.57%
none             44.44%
writer           42.22%
marketing        38.46%
other            34.29%
student          30.61%
educator         27.37%
salesman          25.0%
lawyer           16.67%
entertainment    11.11%
scientist         9.68%
executive         9.38%
programmer        9.09%
retired           7.14%
technician         3.7%
engineer          2.99%
doctor             0.0%
dtype: object

In [21]:
users

     user_id  age gender     occupation zip_code  gender_n
0          1   24      M     technician    85711         1
1          2   53      F          other    94043         0
2          3   23      M         writer    32067         1
3          4   24      M     technician    43537         1
4          5   33      F          other    15213         0
..       ...  ...    ...            ...      ...       ...
938      939   26      F        student    33319         0
939      940   32      M  administrator    02215         1
940      941   20      M        student    97229         1
941      942   48      F      librarian    78209         0
942      943   22      M        student    77841         1

[943 rows x 6 columns]

In [22]:
grouped = users.groupby("occupation").mean()
grouped["f"] = f
grouped.loc[:, "f":"f"]

                    f
occupation
administrator  45.57%
artist         46.43%
doctor           0.0%
educator       27.37%
engineer        2.99%
entertainment  11.11%
executive       9.38%
healthcare     68.75%
homemaker      85.71%
lawyer         16.67%
librarian      56.86%
marketing      38.46%
none           44.44%
other          34.29%
programmer      9.09%
retired         7.14%
salesman        25.0%
scientist       9.68%
student        30.61%
technician       3.7%
writer         42.22%

In [23]:
# create a data frame and apply count to gender
gender_ocup = users.groupby(['occupation', 'gender']).agg({'count'})

gender_ocup

                     user_id   age zip_code gender_n
                       count count    count    count
occupation    gender
administrator F           36    36       36       36
              M           43    43       43       43
artist        F           13    13       13       13
              M           15    15       15       15
doctor        M            7     7        7        7
educator      F           26    26       26       26
              M           69    69       69       69
engineer      F            2     2        2        2
              M           65    65       65       65
entertainment F            2     2        2        2
              M           16    16       16       16
executive     F            3     3        3        3
              M           29    29       29       29
healthcare    F           11    11       11       11
              M            5     5        5        5
homemaker     F            6     6        6        6
              M            1     1        1        1
lawyer        F            2     2        2        2
              M           10    10       10       10
librarian     F           29    29       29       29
              M           22    22       22       22
marketing     F           10    10       10       10
              M           16    16       16       16
none          F            4     4        4        4
              M            5     5        5        5
other         F           36    36       36       36
              M           69    69       69       69
programmer    F            6     6        6        6
              M           60    60       60       60
retired       F            1     1        1        1
              M           13    13       13       13
salesman      F            3     3        3        3
              M            9     9        9        9
scientist     F            3     3        3        3
              M           28    28       28       28
student       F           60    60       60       60
              M          136   136      136      136
technician    F            1     1        1        1
              M           26    26       26       26
writer        F           19    19       19       19
              M           26    26       26       26